In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("scores.csv", names=["player", "score"])
df.head()

   player  score
0   rohit      9
1  shakib     56
2   babar     56
3   rohit    120
4   rohit    105

In [3]:
g = df.groupby("player")

for player, player_df in g:
    print(player, "==>", "Min:", player_df.score.min(),
                         "Max:", player_df.score.max(),
                         "Avg:", player_df.score.mean())

babar ==> Min: 5 Max: 120 Avg: 58.6
rohit ==> Min: 9 Max: 140 Avg: 100.8
shakib ==> Min: 56 Max: 102 Avg: 77.0

In [4]:
g.max()

        score
player
babar     120
rohit     140
shakib    102

In [5]:
g.min()

        score
player
babar       5
rohit       9
shakib     56

In [6]:
g.mean()

        score
player
babar    58.6
rohit   100.8
shakib   77.0